app/controllers/iacs_controller.rb

SELECT "iacs".* FROM "iacs" WHERE "iacs"."identity" = 'nanooq@hasi.it' LIMIT 1
---
  def getAddress
    @iac = Iac.find_by_identity(params[:identity])