app/controllers/iacs_controller.rb

SELECT "iacs".* FROM "iacs" WHERE "iacs"."identity" = 'standard@nanooq.org' LIMIT 1
---
  def getUrl
#    @iac = Iac.where(identity: params[:identity])
    @iac = Iac.find_by_identity(params[:identity])

SELECT "iacs".* FROM "iacs"
---
  def index
    @iacs = Iac.all

SELECT "iacs".* FROM "iacs" WHERE "iacs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @iac = Iac.find(params[:id])

INSERT INTO "iacs" ("address", "created_at", "identity", "identity_type", "status", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", "test"], ["created_at", Fri, 08 Feb 2013 08:44:37 UTC +00:00], ["identity", "test"], ["identity_type", "test"], ["status", "test"], ["updated_at", Fri, 08 Feb 2013 08:44:37 UTC +00:00]]
---
  def create
    @iac = Iac.new(params[:iac])

    respond_to do |format|
      if @iac.save

SELECT "iacs".* FROM "iacs" WHERE "iacs"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "iacs" WHERE "iacs"."id" = ?  [["id", 3]]
---
  def destroy
    @iac = Iac.find(params[:id])
    @iac.destroy